# Parameters 2 2 8 2
# [dm=1.33 wm=1.25 193162357params] [dm=0.33 wm=0.50 60041461params] [dm=1.33 wm=0.50 72343285params] [dm=0.33 wm=1.25 116327797params]
# [dm=0.33 wm=1.00 92339189params] [dm=1.00 wm=1.00 125125621params] [dm=0.67 wm=0.75 82799989params]
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  [[-1, 1, RepLKNet_Stem, [128, 3, [128,256,512,1024]]],
   [-1, 1, RepLKNet_stage1, [256, [128,256,512,1024], [31,29,27,13], [2,2,8,2], 0.3, 5, 1, 4]],
   [-1, 1, RepLKNet_stage2, [512, [128,256,512,1024], [31,29,27,13], [2,2,8,2], 0.3, 5, 1, 4]],
   [-1, 1, RepLKNet_stage3, [1024, [128,256,512,1024], [31,29,27,13], [2,2,8,2], 0.3, 5, 1, 4]],
   [-1, 1, RepLKNet_stage4, [1024, [128,256,512,1024], [31,29,27,13], [2,2,8,2], 0.3, 5, 1, 4]],
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P4  512concat1024
   [-1, 3, C3, [1024, False]],  # 13

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],  # cat backbone P3  256concat512
   [-1, 3, C3, [512, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P4  512concat512
   [-1, 3, C3, [1024, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 5], 1, Concat, [1]],  # cat head P5  1024concat1024
   [-1, 3, C3, [2048, False]],  # 23 (P5/32-large)

   [[12, 15, 18], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]